export function sidebarPmp() {
  return [
    {
      text: 'PMP',
      collapsed: false,
      items: [
        { text: '什么是PMP', link: 'PMP/认识PMP' },
        { text: '学习计划', link: 'PMP/学习计划' },
      ],
    },
    {
      text: '资料',
      collapsed: false,
      items: [
        { text: '0-开始', link: 'PMP/资料/' },
        { text: '1-电子版教材', link: 'PMP/资料/1-电子教材/电子教材' },
        { text: '2-PMP MAX3.0 学习笔记', link: 'PMP/资料/2-PMPMAX3.0学习笔记-配套《PMP备考宝典（第2版）》/2-PMPMAX3.0学习笔记-配套《PMP备考宝典（第2版）》' },
        { text: '3-冲刺串讲学习笔记', link: 'PMP/资料/3-冲刺串讲学习笔记-配套《PMP通关一本通》/3-冲刺串讲学习笔记-配套《PMP通关一本通》' },
        { text: '4-1-PMP做题技巧36计', link: 'PMP/资料/4-知识点总结/PMP做题技巧36计' },
        { text: '4-2-PMP考试过关口诀', link: 'PMP/资料/4-知识点总结/PMP考试过关口诀/PMP考试过关口诀' },
        { text: '8.十五至尊图', link: 'PMP/资料/十五至尊图' },
        // { text: '11.整理资料（知识点总结）', link: 'PMP/整理资料（知识点总结）' }
        // { text: '光环国际PMP知识点总结超强版', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版' },
      ],
    },
    {
      text: '光环国际PMP知识点总结超强版',
      collapsed: false,
      items: [
        { text: '1. 重要考点', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#重要考点'},
        { text: '2. 场景梳理', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#场景梳理'},
        { text: '3. 观点题技巧梳理', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#观点题技巧梳理'},
        { text: '4. 读题技巧', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#读题技巧'},
        { text: '5. 敏捷题的做题技巧', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#敏捷题的做题技巧'},
        { text: '6. pmp-五大过程组完整梳理', link: 'PMP/光环国际PMP知识点总结超强版/光环国际PMP知识点总结超强版#pmp-五大过程组完整梳理'},

        
      ],
    },
    {
      text: 'ITTO图',
      collapsed: false,
      items: [
        { text: '4. 项目整合管理', link: 'PMP/ITTO图/4. 项目整合管理' },
        { text: '5. 项目范围管理', link: 'PMP/ITTO图/5. 项目范围管理' },
        { text: '6. 项目进度管理', link: 'PMP/ITTO图/6. 项目进度管理' },
        { text: '7. 项目成本管理', link: 'PMP/ITTO图/7. 项目成本管理' },
        { text: '8. 项目质量管理', link: 'PMP/ITTO图/8. 项目质量管理' },
        { text: '9. 项目资源管理', link: 'PMP/ITTO图/9. 项目资源管理' },
        { text: '10. 项目沟通管理', link: 'PMP/ITTO图/10. 项目沟通管理' },
        { text: '11. 项目风险管理', link: 'PMP/ITTO图/11. 项目风险管理' },
        { text: '12. 项目采购管理', link: 'PMP/ITTO图/12. 项目采购管理' },
        { text: '13. 项目相关方管理', link: 'PMP/ITTO图/13. 项目相关方管理' },
      ],
    },
    {
      text: '光环国际PMP课程学习笔记',
      collapsed: false,
      items: [
        { text: '第01章 导论', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第01章-导论' },
        { text: '第02章 项目运行环境', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第02章-项目运行环境'},
        { text: '第03章 项目经理的角色', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第03章-项目经理的角色'},
        { text: '第04章 项目整合管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第04章-项目整合管理'},
        { text: '第05章 项目范围管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第05章-项目范围管理'},
        { text: '第06章 项目进度管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第06章-项目进度管理'},
        { text: '第07章 项目成本管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第07章-项目成本管理'},
        { text: '第08章 项目质量管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第08章-项目质量管理'},
        { text: '第09章 项目资源管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第09章-项目资源管理'},
        { text: '第10章 项目沟通管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第10章-项目沟通管理'},
        { text: '第11章 项目风险管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第11章-项目风险管理'},
        { text: '第12章 项目采购管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第12章-项目采购管理'},
        { text: '第13章 项目相关方管理', link: 'PMP/光环国际PMP课程学习笔记/光环国际PMP课程学习笔记#第13章-项目相关方管理'},
      ],
    },
    {
      text: '光环国际PMP章节练习题',
      collapsed: false,
      items: [
        { text: '引论+环境', link: 'PMP/光环国际PMP章节练习题/引论+环境' },
        { text: '人员', link: 'PMP/光环国际PMP章节练习题/人员' },
        { text: '过程', link: 'PMP/光环国际PMP章节练习题/过程' },
        { text: 'PMP模考题（二）', link: 'PMP/PMP模考题（二）' },
        { text: 'chatGPT指令（选择题格式转换）', link: 'PMP/光环国际PMP章节练习题/chatGPT指令（选择题格式转换）' },
        
      ],
    },
    {
      text: '30张项目管理思维导图',
      collapsed: false,
      items: [
        { text: '0、目录', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_0、目录' },
        { text: '1、怎么更好的管理项目进度？', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_1、怎么更好的管理项目进度' },
        { text: '2、如何做好项目复盘', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_2、如何做好项目复盘' },
        { text: '3、权利游戏，没实权的pm怎么搞起来', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_3、权利游戏-没实权的pm怎么搞起来' },
        { text: '4、项目管理中如何有效沟通', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_4、项目管理中如何有效沟通' },
        { text: '5、如何让公司员工把工作高效完成', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_5、如何让公司员工把工作高效完成' },
        { text: '6、上升空间有限时，该继续努力还是换单位', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_6、上升空间有限时-该继续努力还是换单位' },
        { text: '7、如何在弱矩阵组织中干好项目经理的工作', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_7、如何在弱矩阵组织中干好项目经理的工作' },
        { text: '8、如何激励项目团队成员前进', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_8、如何激励项目团队成员前进' },
        { text: '9、非技术人员在IT公司做PM哪个方向很有利', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_9、非技术人员在it公司做pm哪个方向很有利' },
        { text: '10、如何准确的对项目资源、成本、工时进行估算', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_10、如何准确的对项目资源、成本、工时进行估算' },
        { text: '11、由技术向项目管理方向转思维与实践该何如转变', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_11、由技术向项目管理方向转思维与实践该何如转变' },
        { text: '12、关键项目成员离职PM如何平衡好进度、范围和成本', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_12、关键项目成员离职pm如何平衡好进度、范围和成本' },
        { text: '13、如何在全新的创业公司下创建项目管理流程', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_13、如何在全新的创业公司下创建项目管理流程' },
        { text: '14、项目管理人员如何向部门经理转型', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_14、项目管理人员如何向部门经理转型' },
        { text: '15、传统项目管理模式如何向敏捷开发精益项目管理转型', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_15、传统项目管理模式如何向敏捷开发精益项目管理转型' },
        { text: '16、有什么方法技巧，可以让项目团队成员听从你', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_16、有什么方法技巧-可以让项目团队成员听从你' },
        { text: '17、如何充分调动跨区域、跨部门的同事', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_17、如何充分调动跨区域、跨部门的同事' },
        { text: '18、团队绩效考核如何制定？如何设置奖惩', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_18、团队绩效考核如何制定-如何设置奖惩' },
        { text: '19、PM换工作跨行业的成功率有多大', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_19、pm换工作跨行业的成功率有多大' },
        { text: '20、公司重技术轻管理，项目经理变跑腿打杂的怎么办', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_20、公司重技术轻管理-项目经理变跑腿打杂的怎么办' },
        { text: '21、团队成员不配合不把项目经理当回事怎么办', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_21、团队成员不配合不把项目经理当回事怎么办' },
        { text: '22、PMO如何开展工作', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_22、pmo如何开展工作' },
        { text: '23、如何应对强势客户需求蔓延', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_23、如何应对强势客户需求蔓延' },
        { text: '24、如何控制项目进度产品质量的平衡', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_24、如何控制项目进度产品质量的平衡' },
        { text: '25、如何处理项目组内的踢皮球事情', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_25、如何处理项目组内的踢皮球事情' },
        { text: '26、如何在指定项目章程时充分发挥专家作用', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_26、如何在指定项目章程时充分发挥专家作用' },
        { text: '27、如何召开头脑风暴会议', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_27、如何召开头脑风暴会议' },
        { text: '28、如何使用焦点小组会议挖掘用户需求', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_28、如何使用焦点小组会议挖掘用户需求' },
        { text: '29、如何做好项目过程中的会议管理', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_29、如何做好项目过程中的会议管理' },
        { text: '30、如何调动项目组积极性，加快项目推进', link: 'PMP/30张项目管理思维导图/30张项目管理思维导图#_30、如何调动项目组积极性-加快项目推进' },
      ],
    },
  ];
}

export function sidebarCsmm() {
  return [
    {
      text: 'CSMM',
      collapsed: false,
      items: [
        { text: '什么是CSMM', link: 'CSMM/认识CSMM' }
      ],
    },
    {
      text: '治理',
      collapsed: false,
      items: [
        { text: '战略与治理', link: 'CSMM/战略与治理' },
        { text: '目标管理', link: 'CSMM/目标管理' }
      ],
    },
    {
      text: '开发与交付',
      collapsed: false,
      items: [
        { text: '需求', link: 'CSMM/开发与交付/需求' },
        { text: '设计', link: 'CSMM/开发与交付/设计' },
        { text: '开发', link: 'CSMM/开发与交付/开发' },
        { text: '测试', link: 'CSMM/开发与交付/测试' },
        { text: '部署', link: 'CSMM/开发与交付/部署' },
        { text: '服务', link: 'CSMM/开发与交付/服务' },
        { text: '开源应用', link: 'CSMM/开发与交付/开源应用' },
      ],
    },
    {
      text: '管理与支持',
      collapsed: false,
      items: [
        { text: '项目策划', link: 'CSMM/管理与支持/项目策划' },
        { text: '项目监控', link: 'CSMM/管理与支持/项目监控' },
        { text: '项目结项', link: 'CSMM/管理与支持/项目结项' },
        { text: '风险管理', link: 'CSMM/管理与支持/风险管理' },
        { text: '质量保证', link: 'CSMM/管理与支持/质量保证' },
        { text: '配置管理', link: 'CSMM/管理与支持/配置管理' },
        { text: '供应商管理', link: 'CSMM/管理与支持/供应商管理' },
      ],
    },
    {
      text: '组织管理',
      collapsed: false,
      items: [
        { text: '过程管理', link: 'CSMM/组织管理/过程管理' },
        { text: '人员能力管理', link: 'CSMM/组织管理/人员能力管理' },
        { text: '组织资源管理', link: 'CSMM/组织管理/组织资源管理' },
        { text: '过程能力管理', link: 'CSMM/组织管理/过程能力管理' },
      ],
    },
  ];
}